Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/component/at.h
#define AT_anti_tamper__FILTERCFG_THRESH_Pos  _UINT32_(0)                                          /* (AT_anti_tamper__FILTERCFG) Threshold. Position */
#define AT_anti_tamper__FILTERCFG_THRESH_Msk  (_UINT32_(0x7) << AT_anti_tamper__FILTERCFG_THRESH_Pos) /* (AT_anti_tamper__FILTERCFG) Threshold. Mask */
#define AT_anti_tamper__FILTERCFG_THRESH(value) (AT_anti_tamper__FILTERCFG_THRESH_Msk & (_UINT32_(value) << AT_anti_tamper__FILTERCFG_THRESH_Pos)) /* Assignment of value for THRESH in the AT_anti_tamper__FILTERCFG register */
#define AT_anti_tamper__FILTERCFG_PERIOD_Pos  _UINT32_(8)                                          /* (AT_anti_tamper__FILTERCFG) Period. Position */
#define AT_anti_tamper__FILTERCFG_PERIOD_Msk  (_UINT32_(0x1F) << AT_anti_tamper__FILTERCFG_PERIOD_Pos) /* (AT_anti_tamper__FILTERCFG) Period. Mask */
#define AT_anti_tamper__FILTERCFG_PERIOD(value) (AT_anti_tamper__FILTERCFG_PERIOD_Msk & (_UINT32_(value) << AT_anti_tamper__FILTERCFG_PERIOD_Pos)) /* Assignment of value for PERIOD in the AT_anti_tamper__FILTERCFG register */
#define AT_anti_tamper__FILTERCFG_PROTKEY_Pos _UINT32_(16)                                         /* (AT_anti_tamper__FILTERCFG) Protection key (0x92F5). Position */
#define AT_anti_tamper__FILTERCFG_PROTKEY_Msk (_UINT32_(0xFFFF) << AT_anti_tamper__FILTERCFG_PROTKEY_Pos) /* (AT_anti_tamper__FILTERCFG) Protection key (0x92F5). Mask */
#define AT_anti_tamper__FILTERCFG_PROTKEY(value) (AT_anti_tamper__FILTERCFG_PROTKEY_Msk & (_UINT32_(value) << AT_anti_tamper__FILTERCFG_PROTKEY_Pos)) /* Assignment of value for PROTKEY in the AT_anti_tamper__FILTERCFG register */
#define AT_anti_tamper__FILTERCFG_Msk         _UINT32_(0xFFFF1F07)                                 /* (AT_anti_tamper__FILTERCFG) Register Mask  */


/* -------- AT_anti_tamper__SOFTTAMP : (AT Offset: 0x218) (R/W 32) Software triggered tamper. -------- */
#define AT_anti_tamper__SOFTTAMP_RESETVALUE   _UINT32_(0x00)                                       /*  (AT_anti_tamper__SOFTTAMP) Software triggered tamper.  Reset Value */

#define AT_anti_tamper__SOFTTAMP_ACTIVE_Pos   _UINT32_(0)                                          /* (AT_anti_tamper__SOFTTAMP) Tamper active. Position */
#define AT_anti_tamper__SOFTTAMP_ACTIVE_Msk   (_UINT32_(0x1) << AT_anti_tamper__SOFTTAMP_ACTIVE_Pos) /* (AT_anti_tamper__SOFTTAMP) Tamper active. Mask */
#define AT_anti_tamper__SOFTTAMP_ACTIVE(value) (AT_anti_tamper__SOFTTAMP_ACTIVE_Msk & (_UINT32_(value) << AT_anti_tamper__SOFTTAMP_ACTIVE_Pos)) /* Assignment of value for ACTIVE in the AT_anti_tamper__SOFTTAMP register */
#define AT_anti_tamper__SOFTTAMP_ID_Pos       _UINT32_(8)                                          /* (AT_anti_tamper__SOFTTAMP) Tamper ID. Position */
#define AT_anti_tamper__SOFTTAMP_ID_Msk       (_UINT32_(0x1F) << AT_anti_tamper__SOFTTAMP_ID_Pos)  /* (AT_anti_tamper__SOFTTAMP) Tamper ID. Mask */
#define AT_anti_tamper__SOFTTAMP_ID(value)    (AT_anti_tamper__SOFTTAMP_ID_Msk & (_UINT32_(value) << AT_anti_tamper__SOFTTAMP_ID_Pos)) /* Assignment of value for ID in the AT_anti_tamper__SOFTTAMP register */
#define AT_anti_tamper__SOFTTAMP_PROTKEY_Pos  _UINT32_(16)                                         /* (AT_anti_tamper__SOFTTAMP) Protection key (0x4BEE). Position */
#define AT_anti_tamper__SOFTTAMP_PROTKEY_Msk  (_UINT32_(0xFFFF) << AT_anti_tamper__SOFTTAMP_PROTKEY_Pos) /* (AT_anti_tamper__SOFTTAMP) Protection key (0x4BEE). Mask */
#define AT_anti_tamper__SOFTTAMP_PROTKEY(value) (AT_anti_tamper__SOFTTAMP_PROTKEY_Msk & (_UINT32_(value) << AT_anti_tamper__SOFTTAMP_PROTKEY_Pos)) /* Assignment of value for PROTKEY in the AT_anti_tamper__SOFTTAMP register */
#define AT_anti_tamper__SOFTTAMP_Msk          _UINT32_(0xFFFF1F01)                                 /* (AT_anti_tamper__SOFTTAMP) Register Mask  */


/* -------- AT_anti_tamper__RAWSTAT : (AT Offset: 0x21C) ( R/ 32) Raw status. -------- */
#define AT_anti_tamper__RAWSTAT_RESETVALUE    _UINT32_(0x00)                                       /*  (AT_anti_tamper__RAWSTAT) Raw status.  Reset Value */

#define AT_anti_tamper__RAWSTAT_RAWSTAT_Pos   _UINT32_(0)                                          /* (AT_anti_tamper__RAWSTAT) Raw status. Position */
#define AT_anti_tamper__RAWSTAT_RAWSTAT_Msk   (_UINT32_(0xFFFFFFFF) << AT_anti_tamper__RAWSTAT_RAWSTAT_Pos) /* (AT_anti_tamper__RAWSTAT) Raw status. Mask */
#define AT_anti_tamper__RAWSTAT_RAWSTAT(value) (AT_anti_tamper__RAWSTAT_RAWSTAT_Msk & (_UINT32_(value) << AT_anti_tamper__RAWSTAT_RAWSTAT_Pos)) /* Assignment of value for RAWSTAT in the AT_anti_tamper__RAWSTAT register */
#define AT_anti_tamper__RAWSTAT_Msk           _UINT32_(0xFFFFFFFF)                                 /* (AT_anti_tamper__RAWSTAT) Register Mask  */


/* -------- AT_anti_tamper__STAT : (AT Offset: 0x220) (R/W 32) Status (write to clear). -------- */
#define AT_anti_tamper__STAT_RESETVALUE       _UINT32_(0x01)                                       /*  (AT_anti_tamper__STAT) Status (write to clear).  Reset Value */

#define AT_anti_tamper__STAT_STAT_Pos         _UINT32_(0)                                          /* (AT_anti_tamper__STAT) Status (write to clear). Position */
#define AT_anti_tamper__STAT_STAT_Msk         (_UINT32_(0xFFFFFFFF) << AT_anti_tamper__STAT_STAT_Pos) /* (AT_anti_tamper__STAT) Status (write to clear). Mask */
#define AT_anti_tamper__STAT_STAT(value)      (AT_anti_tamper__STAT_STAT_Msk & (_UINT32_(value) << AT_anti_tamper__STAT_STAT_Pos)) /* Assignment of value for STAT in the AT_anti_tamper__STAT register */
#define AT_anti_tamper__STAT_Msk              _UINT32_(0xFFFFFFFF)                                 /* (AT_anti_tamper__STAT) Register Mask  */


/* -------- AT_anti_tamper__TIMESTAMP : (AT Offset: 0x224) ( R/ 32) Timestamp for the last tamper. -------- */
#define AT_anti_tamper__TIMESTAMP_RESETVALUE  _UINT32_(0x00)                                       /*  (AT_anti_tamper__TIMESTAMP) Timestamp for the last tamper.  Reset Value */

#define AT_anti_tamper__TIMESTAMP_TIMESTAMP_Pos _UINT32_(0)                                          /* (AT_anti_tamper__TIMESTAMP) Timestamp for the last tamper. Position */
#define AT_anti_tamper__TIMESTAMP_TIMESTAMP_Msk (_UINT32_(0xFFFFFFFF) << AT_anti_tamper__TIMESTAMP_TIMESTAMP_Pos) /* (AT_anti_tamper__TIMESTAMP) Timestamp for the last tamper. Mask */
#define AT_anti_tamper__TIMESTAMP_TIMESTAMP(value) (AT_anti_tamper__TIMESTAMP_TIMESTAMP_Msk & (_UINT32_(value) << AT_anti_tamper__TIMESTAMP_TIMESTAMP_Pos)) /* Assignment of value for TIMESTAMP in the AT_anti_tamper__TIMESTAMP register */
#define AT_anti_tamper__TIMESTAMP_Msk         _UINT32_(0xFFFFFFFF)                                 /* (AT_anti_tamper__TIMESTAMP) Register Mask  */


/* -------- AT_anti_tamper__FILTERCNT : (AT Offset: 0x228) ( R/ 32) Current value of filter counter. -------- */
#define AT_anti_tamper__FILTERCNT_RESETVALUE  _UINT32_(0x00)                                       /*  (AT_anti_tamper__FILTERCNT) Current value of filter counter.  Reset Value */

#define AT_anti_tamper__FILTERCNT_FILTERCNT_Pos _UINT32_(0)                                          /* (AT_anti_tamper__FILTERCNT) Current value of filter counter. Position */
#define AT_anti_tamper__FILTERCNT_FILTERCNT_Msk (_UINT32_(0xFFFFFFFF) << AT_anti_tamper__FILTERCNT_FILTERCNT_Pos) /* (AT_anti_tamper__FILTERCNT) Current value of filter counter. Mask */
#define AT_anti_tamper__FILTERCNT_FILTERCNT(value) (AT_anti_tamper__FILTERCNT_FILTERCNT_Msk & (_UINT32_(value) << AT_anti_tamper__FILTERCNT_FILTERCNT_Pos)) /* Assignment of value for FILTERCNT in the AT_anti_tamper__FILTERCNT register */
#define AT_anti_tamper__FILTERCNT_Msk         _UINT32_(0xFFFFFFFF)                                 /* (AT_anti_tamper__FILTERCNT) Register Mask  */


/* -------- AT_anti_tamper__SOFTINFO : (AT Offset: 0x22C) (R/W 32) Register for software purpose only. -------- */
#define AT_anti_tamper__SOFTINFO_RESETVALUE   _UINT32_(0x00)                                       /*  (AT_anti_tamper__SOFTINFO) Register for software purpose only.  Reset Value */

