Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/component/at.h
#define AT_anti_tamper__SOFTINFO_SOFTINFO_Pos _UINT32_(0)                                          /* (AT_anti_tamper__SOFTINFO) Register for software purpose only. Position */
#define AT_anti_tamper__SOFTINFO_SOFTINFO_Msk (_UINT32_(0xFFFFFFFF) << AT_anti_tamper__SOFTINFO_SOFTINFO_Pos) /* (AT_anti_tamper__SOFTINFO) Register for software purpose only. Mask */
#define AT_anti_tamper__SOFTINFO_SOFTINFO(value) (AT_anti_tamper__SOFTINFO_SOFTINFO_Msk & (_UINT32_(value) << AT_anti_tamper__SOFTINFO_SOFTINFO_Pos)) /* Assignment of value for SOFTINFO in the AT_anti_tamper__SOFTINFO register */
#define AT_anti_tamper__SOFTINFO_Msk          _UINT32_(0xFFFFFFFF)                                 /* (AT_anti_tamper__SOFTINFO) Register Mask  */


/* -------- AT_anti_tamper__TAMPERFLAG : (AT Offset: 0x230) (R/W 32) The 1-bit TAMPERFLAG register directly controls the TAMPER_FLAG output. -------- */
#define AT_anti_tamper__TAMPERFLAG_RESETVALUE _UINT32_(0x00)                                       /*  (AT_anti_tamper__TAMPERFLAG) The 1-bit TAMPERFLAG register directly controls the TAMPER_FLAG output.  Reset Value */

#define AT_anti_tamper__TAMPERFLAG_TAMPERFLAG_Pos _UINT32_(0)                                          /* (AT_anti_tamper__TAMPERFLAG) The 1-bit TAMPERFLAG register directly controls the TAMPER_FLAG output. Position */
#define AT_anti_tamper__TAMPERFLAG_TAMPERFLAG_Msk (_UINT32_(0x1) << AT_anti_tamper__TAMPERFLAG_TAMPERFLAG_Pos) /* (AT_anti_tamper__TAMPERFLAG) The 1-bit TAMPERFLAG register directly controls the TAMPER_FLAG output. Mask */
#define AT_anti_tamper__TAMPERFLAG_TAMPERFLAG(value) (AT_anti_tamper__TAMPERFLAG_TAMPERFLAG_Msk & (_UINT32_(value) << AT_anti_tamper__TAMPERFLAG_TAMPERFLAG_Pos)) /* Assignment of value for TAMPERFLAG in the AT_anti_tamper__TAMPERFLAG register */
#define AT_anti_tamper__TAMPERFLAG_Msk        _UINT32_(0x00000001)                                 /* (AT_anti_tamper__TAMPERFLAG) Register Mask  */


/* -------- AT_anti_tamper__SOFTRESET : (AT Offset: 0x234) ( R/ 32) Reading the SOFTLVL4 register returns 1 if any active soft tamper has a level of 4 or above. -------- */
#define AT_anti_tamper__SOFTRESET_RESETVALUE  _UINT32_(0x00)                                       /*  (AT_anti_tamper__SOFTRESET) Reading the SOFTLVL4 register returns 1 if any active soft tamper has a level of 4 or above.  Reset Value */

#define AT_anti_tamper__SOFTRESET_SOFTRESET_Pos _UINT32_(0)                                          /* (AT_anti_tamper__SOFTRESET) Reading the SOFTLVL4 register returns 1 if any active soft tamper has a level of 4 or above. Position */
#define AT_anti_tamper__SOFTRESET_SOFTRESET_Msk (_UINT32_(0x1) << AT_anti_tamper__SOFTRESET_SOFTRESET_Pos) /* (AT_anti_tamper__SOFTRESET) Reading the SOFTLVL4 register returns 1 if any active soft tamper has a level of 4 or above. Mask */
#define AT_anti_tamper__SOFTRESET_SOFTRESET(value) (AT_anti_tamper__SOFTRESET_SOFTRESET_Msk & (_UINT32_(value) << AT_anti_tamper__SOFTRESET_SOFTRESET_Pos)) /* Assignment of value for SOFTRESET in the AT_anti_tamper__SOFTRESET register */
#define AT_anti_tamper__SOFTRESET_Msk         _UINT32_(0x00000001)                                 /* (AT_anti_tamper__SOFTRESET) Register Mask  */


/* AT register offsets definitions */
#define AT_CTRLA_REG_OFST              _UINT32_(0x00)      /* (AT_CTRLA) Control Register A Offset */
#define AT_TAMPER_KEY_REG_OFST         _UINT32_(0x100)     /* (AT_TAMPER_KEY) Tamper Key n Register Offset */
#define AT_TAMPER_KEY0_REG_OFST        _UINT32_(0x100)     /* (AT_TAMPER_KEY0) Tamper Key n Register Offset */
#define AT_TAMPER_KEY1_REG_OFST        _UINT32_(0x104)     /* (AT_TAMPER_KEY1) Tamper Key n Register Offset */
#define AT_TAMPER_KEY2_REG_OFST        _UINT32_(0x108)     /* (AT_TAMPER_KEY2) Tamper Key n Register Offset */
#define AT_TAMPER_KEY3_REG_OFST        _UINT32_(0x10C)     /* (AT_TAMPER_KEY3) Tamper Key n Register Offset */
#define AT_TAMPER_KEY4_REG_OFST        _UINT32_(0x110)     /* (AT_TAMPER_KEY4) Tamper Key n Register Offset */
#define AT_TAMPER_KEY5_REG_OFST        _UINT32_(0x114)     /* (AT_TAMPER_KEY5) Tamper Key n Register Offset */
#define AT_TAMPER_KEY6_REG_OFST        _UINT32_(0x118)     /* (AT_TAMPER_KEY6) Tamper Key n Register Offset */
#define AT_TAMPER_KEY7_REG_OFST        _UINT32_(0x11C)     /* (AT_TAMPER_KEY7) Tamper Key n Register Offset */
#define AT_TAMPER_KEY8_REG_OFST        _UINT32_(0x120)     /* (AT_TAMPER_KEY8) Tamper Key n Register Offset */
#define AT_TAMPER_KEY9_REG_OFST        _UINT32_(0x124)     /* (AT_TAMPER_KEY9) Tamper Key n Register Offset */
#define AT_TAMPER_KEY10_REG_OFST       _UINT32_(0x128)     /* (AT_TAMPER_KEY10) Tamper Key n Register Offset */
#define AT_TAMPER_KEY11_REG_OFST       _UINT32_(0x12C)     /* (AT_TAMPER_KEY11) Tamper Key n Register Offset */
#define AT_TAMPER_KEY12_REG_OFST       _UINT32_(0x130)     /* (AT_TAMPER_KEY12) Tamper Key n Register Offset */
#define AT_TAMPER_KEY13_REG_OFST       _UINT32_(0x134)     /* (AT_TAMPER_KEY13) Tamper Key n Register Offset */
#define AT_TAMPER_KEY14_REG_OFST       _UINT32_(0x138)     /* (AT_TAMPER_KEY14) Tamper Key n Register Offset */
#define AT_TAMPER_KEY15_REG_OFST       _UINT32_(0x13C)     /* (AT_TAMPER_KEY15) Tamper Key n Register Offset */
#define AT_anti_tamper__LEVELA_REG_OFST _UINT32_(0x200)     /* (AT_anti_tamper__LEVELA) Tamper levels 0 to 7. Offset */
#define AT_anti_tamper__LEVELB_REG_OFST _UINT32_(0x204)     /* (AT_anti_tamper__LEVELB) Tamper levels 8 to 15. Offset */
#define AT_anti_tamper__LEVELC_REG_OFST _UINT32_(0x208)     /* (AT_anti_tamper__LEVELC) Tamper levels 16 to 23. Offset */
#define AT_anti_tamper__LEVELD_REG_OFST _UINT32_(0x20C)     /* (AT_anti_tamper__LEVELD) Tamper levels 24 to 31. Offset */
#define AT_anti_tamper__SETLEVEL_REG_OFST _UINT32_(0x210)     /* (AT_anti_tamper__SETLEVEL) Set tamper level. Offset */
#define AT_anti_tamper__FILTERCFG_REG_OFST _UINT32_(0x214)     /* (AT_anti_tamper__FILTERCFG) Filter configuration (threshold, period). Offset */
#define AT_anti_tamper__SOFTTAMP_REG_OFST _UINT32_(0x218)     /* (AT_anti_tamper__SOFTTAMP) Software triggered tamper. Offset */
#define AT_anti_tamper__RAWSTAT_REG_OFST _UINT32_(0x21C)     /* (AT_anti_tamper__RAWSTAT) Raw status. Offset */
#define AT_anti_tamper__STAT_REG_OFST  _UINT32_(0x220)     /* (AT_anti_tamper__STAT) Status (write to clear). Offset */
#define AT_anti_tamper__TIMESTAMP_REG_OFST _UINT32_(0x224)     /* (AT_anti_tamper__TIMESTAMP) Timestamp for the last tamper. Offset */
#define AT_anti_tamper__FILTERCNT_REG_OFST _UINT32_(0x228)     /* (AT_anti_tamper__FILTERCNT) Current value of filter counter. Offset */
#define AT_anti_tamper__SOFTINFO_REG_OFST _UINT32_(0x22C)     /* (AT_anti_tamper__SOFTINFO) Register for software purpose only. Offset */
#define AT_anti_tamper__TAMPERFLAG_REG_OFST _UINT32_(0x230)     /* (AT_anti_tamper__TAMPERFLAG) The 1-bit TAMPERFLAG register directly controls the TAMPER_FLAG output. Offset */
#define AT_anti_tamper__SOFTRESET_REG_OFST _UINT32_(0x234)     /* (AT_anti_tamper__SOFTRESET) Reading the SOFTLVL4 register returns 1 if any active soft tamper has a level of 4 or above. Offset */

